app/controllers/api/v1/audiocards_controller.rb

SELECT "audiocards".* FROM "audiocards"
---
  def index
    @audiocards = Audiocard.all