app/controllers/api/v1/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("firstname", "lastname", "email", "password_digest", "created_at") VALUES (?, ?, ?, ?, ?)