app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def current_user
        User.find(session[:user_id])